# MepHeatingCoilType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepHeatingCoilType Property
ParameterTypeId Class See Also
---
"Heating Coil"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepHeatingCoilType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepHeatingCoilType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepHeatingCoilType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace